Tekla Open API Reference for Tekla Structures 2025
PolymeshEdgeTypeEnum Enumeration
 The type of the polymesh edge. This should always correspond 1:1 with geometry::IndirectEdge_s::EdgeType_e on the Tekla Structures Core side
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum PolymeshEdgeTypeEnum
Public Enumeration PolymeshEdgeTypeEnum
Members
Member name | Value | Description
VISIBLE_EDGE | 1 |  Explicitly states that this edge is visible
INVISIBLE_EDGE | 2 |  For hiding edges in visualizations
See Also
Reference
Tekla.Structures.Geometry3d Namespace